"use strict";


// 1. შექმენით მასივი, რომლის საწყისი მნიშვნელობა იქნება რიცხვები: 5, 25, 89, 120, 36;

//   მასივის ბოლოში დაამატეთ ორი ელემენტი(სტრინგი): javascript და python;
//   მასივის დასაწყისში კი დაამატეთ ელემენტი(სტრინგი): html და css;
//   გამოიტანეთ ეკრანზე, რამდენი ელემენტი გაქვთ მასივში;
//   წაშალეთ მასივიდან პირველი და ბოლო ელემენტი;
//   დაბეჭდეთ მასივისი ახალი ელემენტები.

let array = [5, 25, 89, 120, 36]
array.push('javascript', 'python');
array.unshift('html', 'css');
console.log(array.length);
array.pop();
array.shift();
console.log(array);

// 2. შექმენით მასივი, შემდეგი ელემენტებით: ფორთოხალი, ბანანი, მსხალი;

//   გამოიტანეთ ინფორმაცია ეკრანზე თუ რამდენი ელემენტი გაქვთ მასივში;
//   მასივის ბოლოს დაამატეთ ორი ელემენტი: ვაშლი და ანანასი;
//   მასივის დასაწყისში კი დაამატეთ ელემენტი: საზამთრო;
//   გამოიტანეთ ეკრანზე, რამდენი ელემენტი გაქვთ მასივში;
//   მასივის მე-3 ადგილას დაამატეთ ელემენტი: მანგო;
//   წაშალეთ მასივიდან პირველი და ბოლო ელემენტი;
//   გამოიტანეთ ეკრანზე, თუ რამდენი ელემენტი დარჩა მასივში;


let array2 = ['ფორთოხალი', 'ბანანი', 'მსხალი']
console.log(array2.length);
array2.push('ვაშლი', 'ანანასი');
array2.unshift('საზამთრო');
console.log(array2.length);
array2.splice(2, 0, 'მანგო');
array2.pop();
array2.shift();
console.log(array2.length);



// 3.მოცემულია მასივი let array =[1, 2, 3, 4, 5]. Splice მეთოდის საშუალებით მიიღეთ: [1, 2, 3, 'a', 'b', 'c', 4, 5].



let array3 =[1, 2, 3, 4, 5]
array3.splice(3, 0, 'a', 'b', 'c');
console.log(array3);



// 6. დაწერეთ ფუნქცია, რომელსაც პარამეტრად გადაეცემა ორი რიცხვი(ნებისმიერი ჩაწერეთ) და რომელიც შეასრულებს შემდეგ ლოგიკას:
// თუ პირველი რიცხვი მეტია მეორეზე დაიბეჭდოს - num1 is the largest; თუ მეორე რიცხვი მეტია პირველზე - დაიბეჭდოს num2 is the largest; ყველა სხვა დანარჩენ შემთხვევაში დაიბეჭდოს - error; 


let functioon = (x, y) => {
    if(x > y) {
        return 'num1 is the largest'
    } else if (y > x) {
        return 'num2 is the largest'
    }
    return 'error';
}

let newfuncResult = functioon(2, 15)
console.log(newfuncResult);



//  7.  მოცემულია მასივი:
// let array = [12, 25, 3, 6, 8, 14, 7, 23];
// map-ის გამოყენებით შექმენით ახალი მასივი, რომელშიც array მასივიდან თითოეული ელემენტი იქნება 3-ზე გაყოფილი;


let array7 = [12, 25, 3, 6, 8, 14, 7, 23];
let mapedArray = array7.map(i => i / 3)
console.log(mapedArray);


// 9. მოცემულია მასივი:
// Let array=[2,15,10,24] წაშალეთ ამ
// მასივიდან რიცხვი 10;

let array5 = [2,15,10,24]
array5.splice(2, 1);
console.log(array5);
